{"columns":["question","text_answering","rank"],"data":[["Who directed Inception?","Initially, Christopher Nolan wrote an 80-page treatment about dream-stealers.",0],["Who composed the music for Inception?","The score for Inception was written by Hans Zimmer",4],["What is the main plot of Inception?","Dom Cobb and Arthur are \"extractors\" who perform corporate espionage using experimental dream-sharing technology to infiltrate their targets' subconscious and extract information. Their latest target, Saito, is impressed with Cobb's ability to layer multiple dreams within each other. He offers to hire Cobb for the ostensibly impossible job of implanting an idea into a person's subconscious",0],["Who played the role of Dom Cobb in Inception?","Leonardo DiCaprio as Dom Cobb",2],["What is the concept of dream within a dream in Inception?","Nolan wanted to explore \\\"the idea of people sharing a dream space... That gives you the ability to access somebody's unconscious mind",0],["When was Inception released?","Inception was released in both conventional and IMAX theaters on July 16, 2010",0],["What genre is the movie Inception?","Nolan combined elements from several different film genres into the film, notably science fiction, heist film, and film noir.",0],["Did Inception win any Academy Awards?","The film won many awards in technical categories, such as Academy Awards for Best Cinematography",0],["Who are the main cast members in Inception?","Leonardo DiCaprio as Dom Cobb",2],["What is the significance of the spinning top in Inception?","Cobb uses Mal's \"totem\" – a top that spins indefinitely in a dream – to test if he is indeed in the real world",0],["What is inception as explained in the movie?","performing \"inception\" on Robert Fischer, the son of Saito's competitor Maurice Fischer, with the idea to dissolve his father's company",0],["Where was Inception filmed?","Principal photography began in Tokyo",0],["What company produced Inception?","Its official budget was $160 million, split between Warner Bros. and Legendary",2],["Who wrote the screenplay for Inception?","Christopher Nolan wrote an 80-page treatment about dream-stealers",2],["How does time behave in dreams according to Inception?","Time on each layer runs slower than the layer above",0],["What role does Marion Cotillard play in Inception?","Marion Cotillard plays \"Mal\" Cobb, Dom Cobb's projection of his guilt over his deceased wife's suicide",3],["What is the objective of the heist in Inception?"," Robert Fischer, the son of Saito's competitor Maurice Fischer, with the idea to dissolve his father's company",0],["How does Inception end?","The film cuts to the closing credits from a shot of the top apparently starting to show an ever so faint wobble, inviting speculation about whether the final sequence was reality or another dream.",3],["Who is Robert Fischer in Inception?","Robert Fischer, the heir to a business empire and the team's target",0],["How long did Christopher Nolan work on the script for Inception?","Nolan worked on the script for nine to ten years.",3],["Who directed The Dark Knight?","The Dark Knight is a 2008 superhero film directed by Christopher Nolan,",4],["Who played the Joker in The Dark Knight?","Heath Ledger as the Joker",0],["When was The Dark Knight released?","On July 18, 2008, The Dark Knight was widely released in the U.S.",0],["What is the main plot of The Dark Knight?","Wayne struggles to understand the Joker's motives",0],["What awards did The Dark Knight win?","Ledger won the Academy Award for Best Supporting Actor",2],["Who played Batman in The Dark Knight?","Christian Bale as Bruce Wayne \/ Batman",0],["What is the significance of the Joker’s philosophy in The Dark Knight?","The Joker meets Dent in a hospital to explain how expected atrocities, such as the deaths of several soldiers, and societal failings are tolerated but when norms are unexpectedly disrupted, people panic and descend into chaos",0],["Who composed the music for The Dark Knight?","Composers James Newton Howard and Hans Zimmer, who had also worked on Batman Begins, scored The Dark Knight",4],["What is the name of the district attorney in The Dark Knight?","district attorney Harvey Dent",2],["How does Harvey Dent become Two-Face?","The explosives detonate, killing Rachel and severely burning Dent's face on one side",0],["What moral dilemmas are presented in The Dark Knight?","The Dark Knight focuses on the moral and ethical battles faced by the central characters, and the compromises they make to defeat the Joker under extraordinary circumstances. Roger Ebert said the Joker forces impossible ethical decisions on each character to test the limits of their morality",1],["What role does Rachel Dawes play in The Dark Knight?","Maggie Gyllenhaal replaced Katie Holmes as Rachel Dawes",0],["Who kills Rachel Dawes in The Dark Knight?","the Joker gave their positions in reverse. The explosives detonate, killing Rachel",4],["Where was The Dark Knight filmed?","Principal photography began on April 18, 2007, in Chicago ",3],["How does The Dark Knight end?","Gotham, Batman takes the blame for his death and actions and persuades Gordon to conceal the truth. Pennyworth burns an undelivered letter from Rachel to Wayne that says she chose Dent, and Fox destroys the invasive surveillance network that helped Batman find the Joker. The city mourns Dent as a hero, and the police launch a manhunt for Batman.",0],["Why does Batman take the fall for Harvey Dent's actions?","Believing Dent is the hero the city needs and the truth of his corruption will harm Gotham, Batman takes the blame for his death and actions",3],["What themes are explored in The Dark Knight?","A central theme of The Dark Knight is escalation, particularly the rise of the Joker in response to Batman's vigilantism",2],["How did Heath Ledger prepare for his role as the Joker?","Ledger spent about a month secluding himself in a hotel room while reading relevant comic books. He developed the character's voice by mixing a high-pitch and low-pitch, which was inspired by ventriloquist performances. His fighting style was designed to appear improvised and erratic. Ledger spent a further four months creating a \"Joker diary\" containing images and elements he believed would resonate with his character, such as finding the disease AIDS humorous.",4],["What is the Joker's plan in The Dark Knight?","the Joker reveals two evacuation ferries, one carrying civilians and the other prisoners, are rigged to explode at midnight unless one group sacrifices the other.",2],["Who is Lucius Fox in The Dark Knight?","Lucius Fox: Wayne Enterprises' CEO who supplies technology and equipment for Batman's campaign",2],["Who plays Deadpool in the movie?","Ryan Reynolds as Wade Wilson \/ Deadpool",0],["When was Deadpool released?","Deadpool's world premiere was held at the Grand Rex in Paris on February 8, 2016,",0],["What is Deadpool’s real name in the film?","Ryan Reynolds as Wade Wilson \/ Deadpool",0],["How does Wade Wilson become Deadpool?"," Wade is later diagnosed with terminal cancer and is approached by a mysterious recruiter who offers him an experimental treatment that will heal his cancer.",4],["What kind of powers does Deadpool have?","Wade survives due to his new healing factor",1],["Who directed Deadpool?","In April 2011, Tim Miller was hired after working on the visual effects",4],["What is the genre of the movie Deadpool?","Deadpool is a 2016 American superhero film based on the Marvel Comics character of the same name. ",0],["Who is the main villain in Deadpool?","Wade decides to hunt down Ajax",3],["What studio produced Deadpool?","Artisan Entertainment announced a deal with Marvel Entertainment in May 2000 to co-produce,",0],["What is Deadpool’s connection to the X-Men?","the X-Men Colossus and his trainee Negasonic Teenage Warhead interrupt him. Colossus attempts to convince Wade to mend his ways and join the X-Men, but Wade turns him down",0],["Who are Deadpool’s main allies in the movie?","best friend Weasel",0],["What is the name of Deadpool’s girlfriend?","Vanessa Carlysle:An escort and Wilson's fiancée",0],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","a third film starring Reynolds and Hugh Jackman and integrating their characters into the Marvel Cinematic Universe (MCU), was released on July 26, 2024, as part of Phase Five of the MCU.",4],["What was the budget of the Deadpool movie?","Forty-eight hours before the film received the official green light from Fox, the studio cut its budget by $7–$8 million[57] down to $58 million",0],["How successful was Deadpool at the box office?","Deadpool grossed $363.1 million in the United States and Canada and $420 million in other countries for a worldwide total of $783.1 million, against a budget of $58 million. It broke many records with its opening weekend gross across the world, and went on to become the highest-grossing X-Men film, as well as the ninth-highest-grossing film of 2016",4],["Was Deadpool rated R?","the highest-grossing R-rated film at the time",0],["Who directed Fight Club?","Fight Club is a 1999 American film directed by David Fincher ",4],["Who wrote the novel that Fight Club is based on?","It is based on the 1996 novel Fight Club by Chuck Palahniuk",4],["Who plays the narrator in Fight Club?","Edward Norton as the Narrator. ",4],["Who plays Tyler Durden in Fight Club?","Brad Pitt as Tyler Durden",1],["What is the main plot of Fight Club?","The unnamed Narrator, who struggles with insomnia and dissatisfaction with his job and lifestyle, finds temporary solace in support groups",0],["What is the name of the organization that evolves from Fight Club?","Tyler morphs the club into Project Mayhem",0],["What is the narrator's mental condition in Fight Club?","he and Tyler are split personalities. ",0],["Who is Marla Singer in Fight Club?","Marla arrives and she and the Narrator hold hands",0],["How does Fight Club end?","The Narrator shoots himself in the mouth, killing Tyler. Marla arrives and she and the Narrator hold hands as they watch the targeted buildings collapse. ",0],["What role does consumer culture play in Fight Club?","The film references consumer products such as Gucci, Calvin Klein, and the Volkswagen New Beetle. Norton said of the Beetle, \"We smash it ... because it seemed like the classic example of a Baby Boomer generation marketing plan that sold culture back to us.\"",0],["What symbol is often associated with Fight Club?","The firm proposed a bar of pink soap with the title \"Fight Club\" embossed on it as the film's main marketing image",0],["Why was Fight Club controversial upon release?","The film failed to meet the studio's expectations at the box office and received polarized reactions from critics.",3],["Was Fight Club a box office success?","The film failed to meet the studio's expectations at the box office and received polarized reactions from critics.",0],["What year was Fight Club released?","Fight Club is a 1999 American film",4],["Who directed Pulp Fiction?","Pulp Fiction is a 1994 American independent crime film written and directed by Quentin Tarantino",4],["When was Pulp Fiction released?","Pulp Fiction is a 1994 American independent crime film written and directed by Quentin Tarantino",4],["Who are the main actors in Pulp Fiction?","The film stars John Travolta, Samuel L. Jackson, Bruce Willis, Tim Roth, Ving Rhames, and Uma Thurman",4],["What is the narrative style of Pulp Fiction?","Pulp Fiction's narrative is told out of chronological order and follows three main interrelated stories that each have a different protagonist",1],["Who does Samuel L. Jackson play in Pulp Fiction?","Samuel L. Jackson as Jules Winnfield",3],["What is the famous Bible quote used in Pulp Fiction?","Jules ritually recites what he describes as a biblical passage, Ezekiel 25:17, before he executes someone. The passage is heard three times",0],["Who is Vincent Vega?","Vincent Vega, a hitman;",0],["What happens in the diner scene in Pulp Fiction?","Honey Bunny becomes hysterical and points her gun at Jules. Vincent returns with his gun aimed at her, but Jules defuses the situation. He recites the biblical passage, expresses ambivalence about his life of crime, and allows the robbers to take his cash and leave. Jules and Vincent leave the diner with the briefcase. ",0],["What happens to Vincent Vega?","When Vincent exits the bathroom, Butch realizes he is there to kill him, shoots him dead and departs. ",0],["Who is Mia Wallace?","Wallace's wife and an aspiring actress",4],["What happens during Vincent and Mia’s night out?","While Vincent is in the bathroom, Mia finds his heroin, mistakes it for cocaine, and snorts it, resulting in an overdose",4],["Who is Butch Coolidge?","Butch Coolidge, a prizefighter",0],["What is the significance of the gold watch in Pulp Fiction?","A USAF veteran of the Vietnam War who delivers a young Butch his father's coveted gold watch",0],["What award did Pulp Fiction win at Cannes?","Pulp Fiction won the Palme d'Or at the 1994 Cannes Film Festival",0],["How does Pulp Fiction end?","Honey Bunny becomes hysterical and points her gun at Jules. Vincent returns with his gun aimed at her, but Jules defuses the situation. He recites the biblical passage, expresses ambivalence about his life of crime, and allows the robbers to take his cash and leave. Jules and Vincent leave the diner with the briefcase. ",0],["What kind of music is featured in Pulp Fiction?","Quentin Tarantino instead used an eclectic assortment of surf music, rock and roll, soul, and pop songs.",0],["What is Marsellus Wallace’s role in the film?","A crime boss and employer of Jules and Vincent",2],["How does Quentin Tarantino appear in Pulp Fiction?","Tarantino appears as Jules' friend Jimmie",0]]}